webservices/editaccount.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <env:Header>
        <wsse:Security env:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>UserrName</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#">PassWordd</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </env:Header>
    <env:Body>
        <!-- <wd:Workday_Account_for_Worker_Add xmlns:wd="urn:com.workday/bsvc" wd:version="v33.2">
 <wd:Employee_Reference>
                    <wd:Integration_ID_Reference>
                        <wd:ID wd:System_ID="USER-BASED_SECURITY_GROUP-9-113">ISUQASecurityRoleAssigner</wd:ID>
                    </wd:Integration_ID_Reference>
                </wd:Employee_Reference> -->
            <!-- <wd:Non_Worker_Reference> -->
                <!-- <wd:Integration_System_User_Reference> -->
                    <!-- <wd:ID wd:type="WID">326750921ee7013467a5aa508f41c60b</wd:ID> -->
                    <!-- <wd:ID wd:Tenant_Security_Group_ID="USER-BASED_SECURITY_GROUP-9-113">ISUQASecurityRoleAssigner</wd:ID> -->
                    <!-- <wd:ID wd:type="WorkdayUserName">TestISUAccount</wd:ID> -->
                <!-- </wd:Integration_System_User_Reference> -->
                <!-- <wd:ID wd:type="System_User_ID">ISU_ISUSathyaTest</wd:ID> -->
            <!-- </wd:Non_Worker_Reference> -->
            <!-- <wd:Workday_Account_for_Worker_Data>
                <wd:User_Name>ISUSathyaTest</wd:User_Name>
                <wd:Password>Demo@1234</wd:Password>
                <wd:Generate_Random_Password>true</wd:Generate_Random_Password>
                <wd:Require_New_Password_at_Next_Sign_In>true</wd:Require_New_Password_at_Next_Sign_In>
                <wd:Multi-factor_Authentication_Exempt>true</wd:Multi-factor_Authentication_Exempt>
                <wd:Multi-factor_Authentication_Grace_Period_Disabled>true</wd:Multi-factor_Authentication_Grace_Period_Disabled>

            </wd:Workday_Account_for_Worker_Data>
        </wd:Workday_Account_for_Worker_Add> -->

        <!-- <wd:Workday_Account_for_Worker_Update xmlns:wd="urn:com.workday/bsvc" wd:version="v33.2">
             <wd:Employee_Reference>
                    <wd:Integration_ID_Reference>
                        <wd:ID wd:System_ID="USER-BASED_SECURITY_GROUP-9-113">ISUQASecurityRoleAssigner</wd:ID>
                    </wd:Integration_ID_Reference>
                </wd:Employee_Reference> -->
            <!-- <wd:Non_Worker_Reference>
                <wd:ID wd:type="WorkdayUserName">ISUQAWebAutomationUser</wd:ID>
            </wd:Non_Worker_Reference> -->
            <!-- <wd:Workday_Account_for_Worker_Data>
                <wd:User_Name>ISUQASecurityRoleAssigner</wd:User_Name>
             
                <wd:Account_Disabled>true</wd:Account_Disabled>
                
                <wd:Exempt_from_Delegated_Authentication>true</wd:Exempt_from_Delegated_Authentication>
            </wd:Workday_Account_for_Worker_Data>
        </wd:Workday_Account_for_Worker_Update> -->

        <wd:Get_Workday_Account_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v33.2">
            <wd:Request_References>
                <wd:Workday_Account_Reference>
                    <wd:ID wd:type="System_User_ID">ISUQASecurityRoleAssigner</wd:ID>
                </wd:Workday_Account_Reference>
            </wd:Request_References>
            <wd:Request_Criteria></wd:Request_Criteria>
            <wd:Response_Filter>
                <wd:As_Of_Effective_Date>2020-05-13</wd:As_Of_Effective_Date>
                <wd:As_Of_Entry_DateTime>2020-05-13T00:11:04</wd:As_Of_Entry_DateTime>
                <wd:Page>1</wd:Page>
                <wd:Count>100</wd:Count>
            </wd:Response_Filter>
            <wd:Response_Group>
                <wd:Include_Reference>true</wd:Include_Reference>
            </wd:Response_Group>
        </wd:Get_Workday_Account_Request>


    </env:Body>
</env:Envelope>